mahdi-benhassen/esp-agrinet-zigbee-glm5.2/gateway/host/sdkconfig.defaults
# Gateway (ESP32-S3 host) sdkconfig defaults
# Target: ESP32-S3

CONFIG_IDF_TARGET="esp32s3"

# Zigbee gateway (host) configuration - ESP32-H2 RCP over UART1
CONFIG_ZB_ENABLED=y
CONFIG_ZB_GATEWAY=y
CONFIG_ZB_RCP_TRANSPORT_UART=y
CONFIG_ZB_RCP_UART_NUM=1
CONFIG_ZB_RCP_UART_TX_PIN=17
CONFIG_ZB_RCP_UART_RX_PIN=18
CONFIG_ZB_RCP_UART_BAUD_RATE=115200
CONFIG_ZB_CHANNEL=15
CONFIG_ZB_PAN_ID=0x1A2B
CONFIG_ZB_COORDINATOR_ROLE=y

# WiFi
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_MODE_STA=y
CONFIG_ESP_WIFI_MODE_AP=y
CONFIG_ESP_WIFI_STA_RECONNECT=y

# MQTT
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_BUFFER_SIZE=1024

# Partition
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# Flash size (ESP32-S3 DevKitC-1 has 8MB)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# PSRAM on the ESP32-S3 DevKitC-1
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_LOG_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# FreeRTOS
CONFIG_FREERTOS_HZ=100

# Watchdog
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
